### 🛠️ Terraform Plan Result
```terraform
[command]/home/runner/work/_temp/dfbad95c-f068-41d7-9136-fd6ebe91fe1e/terraform-bin plan -no-color
Acquiring state lock. This may take a few moments...
random_string.jwt_secret: Refreshing state... [id=c+%VD<}3-@xyL(#D]
module.project_folder.google_folder.folder[0]: Refreshing state... [id=folders/616505300661]
module.project.google_project.project[0]: Refreshing state... [id=projects/daily-cards-hafifa-project]
module.project.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iamcredentials.googleapis.com]
module.project.google_project_service.project_services["domains.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/domains.googleapis.com]
module.project.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/run.googleapis.com]
module.project.google_project_service.project_services["iap.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iap.googleapis.com]
module.project.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/serviceusage.googleapis.com]
module.project.google_project_service.project_services["dns.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/dns.googleapis.com]
module.project.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iam.googleapis.com]
module.project.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/secretmanager.googleapis.com]
module.project.google_project_service.project_services["certificatemanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/certificatemanager.googleapis.com]
module.project.google_project_service.project_services["vpcaccess.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/vpcaccess.googleapis.com]
module.project.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/servicenetworking.googleapis.com]
module.project.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/sqladmin.googleapis.com]
module.project.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/cloudresourcemanager.googleapis.com]
module.project.google_project_service_identity.default["run.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/run.googleapis.com]
module.project.google_project_service_identity.default["servicenetworking.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/servicenetworking.googleapis.com]
module.project.google_project_service_identity.default["dns.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/dns.googleapis.com]
module.project.google_project_service_identity.default["certificatemanager.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/certificatemanager.googleapis.com]
module.project.google_project_service_identity.default["vpcaccess.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/vpcaccess.googleapis.com]
module.project.google_project_service_identity.default["sqladmin.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/sqladmin.googleapis.com]
module.project.google_project_service_identity.default["iap.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/iap.googleapis.com]
module.project.google_project_service_identity.default["secretmanager.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/secretmanager.googleapis.com]
module.project.google_project_iam_member.service_agents["dns"]: Refreshing state... [id=daily-cards-hafifa-project/roles/dns.serviceAgent/serviceAccount:service-418901622719@gcp-sa-dns.iam.gserviceaccount.com]
module.project.google_project_iam_member.service_agents["certificatemanager"]: Refreshing state... [id=daily-cards-hafifa-project/roles/certificatemanager.serviceAgent/serviceAccount:service-418901622719@gcp-sa-certificatemanager.iam.gserviceaccount.com]
module.project.google_project_iam_member.service_agents["service-networking"]: Refreshing state... [id=daily-cards-hafifa-project/roles/servicenetworking.serviceAgent/serviceAccount:service-418901622719@service-networking.iam.gserviceaccount.com]
module.project.google_project_iam_member.service_agents["serverless-robot-prod"]: Refreshing state... [id=daily-cards-hafifa-project/roles/run.serviceAgent/serviceAccount:service-418901622719@serverless-robot-prod.iam.gserviceaccount.com]
module.project.google_project_iam_member.service_agents["cloud-sql"]: Refreshing state... [id=daily-cards-hafifa-project/roles/cloudsql.serviceAgent/serviceAccount:service-418901622719@gcp-sa-cloud-sql.iam.gserviceaccount.com]
module.project.google_project_iam_member.service_agents["vpcaccess"]: Refreshing state... [id=daily-cards-hafifa-project/roles/vpcaccess.serviceAgent/serviceAccount:service-418901622719@gcp-sa-vpcaccess.iam.gserviceaccount.com]
google_iam_workload_identity_pool.tf: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/tfpool]
data.google_secret_manager_secret_version.iap_client_secret: Reading...
module.front_registry.google_artifact_registry_repository.registry: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/repositories/front-repo]
data.google_secret_manager_secret_version.iap_client_id: Reading...
data.google_secret_manager_secret_version.jwt_secret: Reading...
module.addresses.google_compute_global_address.global["elb"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/addresses/elb]
google_iam_workload_identity_pool.gh: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/cloudrun]
module.cloud_run_back_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/cloudrun-back-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]
google_compute_region_security_policy.israel_only_policy: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/securityPolicies/allow-only-israel]
module.back_registry.google_artifact_registry_repository.registry: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/repositories/back-repo]
module.secret_manager.google_secret_manager_secret.default["jwt-secret"]: Refreshing state... [id=projects/daily-cards-hafifa-project/secrets/jwt-secret]
module.cloudsql_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]
module.external-lb.google_compute_managed_ssl_certificate.default["default"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/sslCertificates/external-lb-default]
module.github_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]
module.vm-managed-sa-example2.google_compute_region_disk.disks["data1"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1]
module.vpc.google_compute_network.network[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/networks/mynetwork]
module.terraform_remote_State.google_storage_bucket.bucket[0]: Refreshing state... [id=tfstate-daily-project]
google_iam_workload_identity_pool_provider.gh: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/cloudrun/providers/ghpool]
google_iam_workload_identity_pool_provider.tf: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/tfpool/providers/tfpool]
module.secret_manager.google_secret_manager_secret_version.default["jwt-secret:v1"]: Refreshing state... [id=projects/418901622719/secrets/jwt-secret/versions/1]
module.cloud_run_back_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/cloudsql.client"]: Refreshing state... [id=daily-cards-hafifa-project/roles/cloudsql.client/serviceAccount:cloudrun-back-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]
module.cloudsql_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/storage.admin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/storage.admin/serviceAccount:cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]
module.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/appengine.appAdmin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/appengine.appAdmin/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]
module.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/owner"]: Refreshing state... [id=daily-cards-hafifa-project/roles/owner/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]
module.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/run.admin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/run.admin/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]
module.db.random_password.passwords["cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com"]: Refreshing state... [id=none]
module.github_sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]
module.github_sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountUser"]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com/roles/iam.serviceAccountUser]
module.vpc.google_compute_subnetwork.proxy_only["me-west1/subnet-exl"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/subnet-exl]
data.google_secret_manager_secret_version.iap_client_id: Read complete after 1s [id=projects/418901622719/secrets/iap-client-id/versions/1]
module.vpc.google_compute_route.gateway["restricted-googleapis"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/routes/mynetwork-restricted-googleapis]
data.google_secret_manager_secret_version.iap_client_secret: Read complete after 1s [id=projects/418901622719/secrets/iap-client-secret/versions/1]
module.vpc.google_compute_route.gateway["private-googleapis"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/routes/mynetwork-private-googleapis]
data.google_secret_manager_secret_version.jwt_secret: Read complete after 1s [id=projects/418901622719/secrets/jwt-secret/versions/1]
module.vpc.google_compute_subnetwork.subnetwork["me-west1/backend-cloudrun"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/backend-cloudrun]
module.vpc.google_compute_subnetwork.subnetwork["me-west1/vm"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/vm]
module.vpc.google_compute_global_address.psa_ranges["servicenetworking-googleapis-com-cloud-sql"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/addresses/servicenetworking-googleapis-com-cloud-sql]
module.vpc.google_service_networking_connection.psa_connection["servicenetworking.googleapis.com"]: Refreshing state... [id=projects%2Fdaily-cards-hafifa-project%2Fglobal%2Fnetworks%2Fmynetwork:servicenetworking.googleapis.com]
module.vpc.google_compute_network_peering_routes_config.psa_routes["servicenetworking.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/networks/mynetwork/networkPeerings/servicenetworking-googleapis-com]
module.firewall.google_compute_firewall.allow-tag-ssh[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-ssh]
module.firewall.google_compute_firewall.allow-tag-https[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-https]
module.firewall.google_compute_firewall.allow-tag-http[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-http]
module.db.google_sql_database_instance.primary: Refreshing state... [id=daily-dashboard]
module.db.google_sql_user.users["cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com"]: Refreshing state... [id=cloudsql-sa@daily-cards-hafifa-project.iam//daily-dashboard]
module.firewall.google_compute_firewall.custom-rules["allow-cloudrun-to-sql"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/allow-cloudrun-to-sql]
module.backend_cloud_run.google_cloud_run_v2_service.service[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/services/backend-daily-cards]
module.frontend_cloud_run.google_cloud_run_v2_service.service[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/services/frontend-daily-cards]
module.external-lb.google_compute_region_network_endpoint_group.serverless["neg-0"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/networkEndpointGroups/external-lb-neg-0]
module.external-lb.google_compute_region_network_endpoint_group.serverless["neg-1"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/networkEndpointGroups/external-lb-neg-1]
module.external-lb.google_compute_backend_service.default["backend"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/backendServices/external-lb-backend]
module.external-lb.google_compute_backend_service.default["frontend"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/backendServices/external-lb-frontend]
module.external-lb.google_compute_url_map.default: Refreshing state... [id=projects/daily-cards-hafifa-project/global/urlMaps/external-lb]
module.external-lb.google_compute_target_https_proxy.default[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/targetHttpsProxies/external-lb]
module.external-lb.google_compute_global_forwarding_rule.default[""]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/forwardingRules/external-lb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.vm-managed-sa-example2.google_compute_instance.default[0] will be created
  + resource "google_compute_instance" "default" {
      + allow_stopping_for_update = true
      + can_ip_forward            = false
      + cpu_platform              = (known after apply)
      + creation_timestamp        = (known after apply)
      + current_status            = (known after apply)
      + deletion_protection       = false
      + description               = "Managed by the compute-vm Terraform module."
      + effective_labels          = {
          + "goog-terraform-provisioned" = "true"
          + "role"                       = "github-runner"
        }
      + enable_display            = false
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + labels                    = {
          + "role" = "github-runner"
        }
      + machine_type              = "e2-medium"
      + metadata                  = {
          + "startup-script" = <<-EOT
                metadata = {
                    startup-script = <<-EOF
                      #!/bin/bash
                      apt-get update && apt-get install -y curl jq git
                      mkdir /actions-runner && cd /actions-runner
                      RUNNER_VERSION="2.316.0"
                      curl -O -L https://github.com/actions/runner/releases/download/v${RUNNER_VERSION}/actions-runner-linux-x64-${RUNNER_VERSION}.tar.gz
                      tar xzf actions-runner-linux-x64-${RUNNER_VERSION}.tar.gz
                      ./config.sh --url https://github.com/ORG/REPO --token $RUNNER_TOKEN --unattended
                      ./svc.sh install && ./svc.sh start
                    EOF
                  }
            EOT
        }
      + metadata_fingerprint      = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "github-runner"
      + project                   = "daily-cards-hafifa-project"
      + self_link                 = (known after apply)
      + tags                      = [
          + "github-runner",
        ]
      + tags_fingerprint          = (known after apply)
      + terraform_labels          = {
          + "goog-terraform-provisioned" = "true"
          + "role"                       = "github-runner"
        }
      + zone                      = "me-west1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + guest_os_features          = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + architecture           = (known after apply)
              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels                 = (known after apply)
              + provisioned_iops       = (known after apply)
              + provisioned_throughput = (known after apply)
              + resource_policies      = (known after apply)
              + size                   = 20
              + snapshot               = (known after apply)
              + type                   = "pd-standard"
            }
        }

      + confidential_instance_config (known after apply)

      + guest_accelerator (known after apply)

      + network_interface {
          + internal_ipv6_prefix_length = (known after apply)
          + ipv6_access_type            = (known after apply)
          + ipv6_address                = (known after apply)
          + name                        = (known after apply)
          + network                     = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/global/networks/mynetwork"
          + network_attachment          = (known after apply)
          + network_ip                  = (known after apply)
          + stack_type                  = (known after apply)
          + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/vm"
          + subnetwork_project          = (known after apply)
        }

      + reservation_affinity (known after apply)

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = "MIGRATE"
          + preemptible         = false
          + provisioning_model  = "STANDARD"
        }

      + service_account {
          + email  = "gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com"
          + scopes = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
        }
    }

  # module.vm-managed-sa-example2.google_compute_region_disk.disks["data1"] will be destroyed
  # (because key ["data1"] is not in for_each map)
  - resource "google_compute_region_disk" "disks" {
      - create_snapshot_before_destroy = false -> null
      - creation_timestamp             = "2025-05-18T06:01:09.840-07:00" -> null
      - disk_id                        = "344832688055936250" -> null
      - effective_labels               = {
          - "disk_name"                  = "data1"
          - "disk_type"                  = "pd-balanced"
          - "goog-terraform-provisioned" = "true"
          - "role"                       = "github-runner"
        } -> null
      - id                             = "projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1" -> null
      - label_fingerprint              = "qLcyRWX_g7o=" -> null
      - labels                         = {
          - "disk_name" = "data1"
          - "disk_type" = "pd-balanced"
          - "role"      = "github-runner"
        } -> null
      - licenses                       = [] -> null
      - name                           = "github-runner-data1" -> null
      - physical_block_size_bytes      = 4096 -> null
      - project                        = "daily-cards-hafifa-project" -> null
      - region                         = "me-west1" -> null
      - replica_zones                  = [
          - "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/zones/me-west1-b",
          - "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/zones/me-west1-c",
        ] -> null
      - self_link                      = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1" -> null
      - size                           = 10 -> null
      - terraform_labels               = {
          - "disk_name"                  = "data1"
          - "disk_type"                  = "pd-balanced"
          - "goog-terraform-provisioned" = "true"
          - "role"                       = "github-runner"
        } -> null
      - type                           = "pd-balanced" -> null
      - users                          = [] -> null
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Available Write-only Attribute Alternative

  with module.db.google_sql_user.users,
  on modules/cloudsql-instance/main.tf line 317, in resource "google_sql_user" "users":
 317:   password = each.value.password

The attribute password has a write-only alternative password_wo available.
Use the write-only alternative of the attribute when possible.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Arandom_string.jwt_secret: Refreshing state... [id=c+%25VD<}3-@xyL(#D]%0Amodule.project_folder.google_folder.folder[0]: Refreshing state... [id=folders/616505300661]%0Amodule.project.google_project.project[0]: Refreshing state... [id=projects/daily-cards-hafifa-project]%0Amodule.project.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iamcredentials.googleapis.com]%0Amodule.project.google_project_service.project_services["domains.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/domains.googleapis.com]%0Amodule.project.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/run.googleapis.com]%0Amodule.project.google_project_service.project_services["iap.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iap.googleapis.com]%0Amodule.project.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/serviceusage.googleapis.com]%0Amodule.project.google_project_service.project_services["dns.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/dns.googleapis.com]%0Amodule.project.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iam.googleapis.com]%0Amodule.project.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/secretmanager.googleapis.com]%0Amodule.project.google_project_service.project_services["certificatemanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/certificatemanager.googleapis.com]%0Amodule.project.google_project_service.project_services["vpcaccess.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/vpcaccess.googleapis.com]%0Amodule.project.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/servicenetworking.googleapis.com]%0Amodule.project.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/sqladmin.googleapis.com]%0Amodule.project.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/cloudresourcemanager.googleapis.com]%0Amodule.project.google_project_service_identity.default["run.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/run.googleapis.com]%0Amodule.project.google_project_service_identity.default["servicenetworking.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/servicenetworking.googleapis.com]%0Amodule.project.google_project_service_identity.default["dns.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/dns.googleapis.com]%0Amodule.project.google_project_service_identity.default["certificatemanager.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/certificatemanager.googleapis.com]%0Amodule.project.google_project_service_identity.default["vpcaccess.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/vpcaccess.googleapis.com]%0Amodule.project.google_project_service_identity.default["sqladmin.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/sqladmin.googleapis.com]%0Amodule.project.google_project_service_identity.default["iap.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/iap.googleapis.com]%0Amodule.project.google_project_service_identity.default["secretmanager.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/secretmanager.googleapis.com]%0Amodule.project.google_project_iam_member.service_agents["dns"]: Refreshing state... [id=daily-cards-hafifa-project/roles/dns.serviceAgent/serviceAccount:service-418901622719@gcp-sa-dns.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["certificatemanager"]: Refreshing state... [id=daily-cards-hafifa-project/roles/certificatemanager.serviceAgent/serviceAccount:service-418901622719@gcp-sa-certificatemanager.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["service-networking"]: Refreshing state... [id=daily-cards-hafifa-project/roles/servicenetworking.serviceAgent/serviceAccount:service-418901622719@service-networking.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["serverless-robot-prod"]: Refreshing state... [id=daily-cards-hafifa-project/roles/run.serviceAgent/serviceAccount:service-418901622719@serverless-robot-prod.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["cloud-sql"]: Refreshing state... [id=daily-cards-hafifa-project/roles/cloudsql.serviceAgent/serviceAccount:service-418901622719@gcp-sa-cloud-sql.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["vpcaccess"]: Refreshing state... [id=daily-cards-hafifa-project/roles/vpcaccess.serviceAgent/serviceAccount:service-418901622719@gcp-sa-vpcaccess.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.tf: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/tfpool]%0Adata.google_secret_manager_secret_version.iap_client_secret: Reading...%0Amodule.front_registry.google_artifact_registry_repository.registry: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/repositories/front-repo]%0Adata.google_secret_manager_secret_version.iap_client_id: Reading...%0Adata.google_secret_manager_secret_version.jwt_secret: Reading...%0Amodule.addresses.google_compute_global_address.global["elb"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/addresses/elb]%0Agoogle_iam_workload_identity_pool.gh: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/cloudrun]%0Amodule.cloud_run_back_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/cloudrun-back-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Agoogle_compute_region_security_policy.israel_only_policy: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/securityPolicies/allow-only-israel]%0Amodule.back_registry.google_artifact_registry_repository.registry: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/repositories/back-repo]%0Amodule.secret_manager.google_secret_manager_secret.default["jwt-secret"]: Refreshing state... [id=projects/daily-cards-hafifa-project/secrets/jwt-secret]%0Amodule.cloudsql_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.external-lb.google_compute_managed_ssl_certificate.default["default"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/sslCertificates/external-lb-default]%0Amodule.github_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.vm-managed-sa-example2.google_compute_region_disk.disks["data1"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1]%0Amodule.vpc.google_compute_network.network[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/networks/mynetwork]%0Amodule.terraform_remote_State.google_storage_bucket.bucket[0]: Refreshing state... [id=tfstate-daily-project]%0Agoogle_iam_workload_identity_pool_provider.gh: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/cloudrun/providers/ghpool]%0Agoogle_iam_workload_identity_pool_provider.tf: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/tfpool/providers/tfpool]%0Amodule.secret_manager.google_secret_manager_secret_version.default["jwt-secret:v1"]: Refreshing state... [id=projects/418901622719/secrets/jwt-secret/versions/1]%0Amodule.cloud_run_back_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/cloudsql.client"]: Refreshing state... [id=daily-cards-hafifa-project/roles/cloudsql.client/serviceAccount:cloudrun-back-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.cloudsql_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/storage.admin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/storage.admin/serviceAccount:cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/appengine.appAdmin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/appengine.appAdmin/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/owner"]: Refreshing state... [id=daily-cards-hafifa-project/roles/owner/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/run.admin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/run.admin/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.db.random_password.passwords["cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com"]: Refreshing state... [id=none]%0Amodule.github_sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]%0Amodule.github_sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountUser"]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com/roles/iam.serviceAccountUser]%0Amodule.vpc.google_compute_subnetwork.proxy_only["me-west1/subnet-exl"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/subnet-exl]%0Adata.google_secret_manager_secret_version.iap_client_id: Read complete after 1s [id=projects/418901622719/secrets/iap-client-id/versions/1]%0Amodule.vpc.google_compute_route.gateway["restricted-googleapis"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/routes/mynetwork-restricted-googleapis]%0Adata.google_secret_manager_secret_version.iap_client_secret: Read complete after 1s [id=projects/418901622719/secrets/iap-client-secret/versions/1]%0Amodule.vpc.google_compute_route.gateway["private-googleapis"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/routes/mynetwork-private-googleapis]%0Adata.google_secret_manager_secret_version.jwt_secret: Read complete after 1s [id=projects/418901622719/secrets/jwt-secret/versions/1]%0Amodule.vpc.google_compute_subnetwork.subnetwork["me-west1/backend-cloudrun"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/backend-cloudrun]%0Amodule.vpc.google_compute_subnetwork.subnetwork["me-west1/vm"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/vm]%0Amodule.vpc.google_compute_global_address.psa_ranges["servicenetworking-googleapis-com-cloud-sql"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/addresses/servicenetworking-googleapis-com-cloud-sql]%0Amodule.vpc.google_service_networking_connection.psa_connection["servicenetworking.googleapis.com"]: Refreshing state... [id=projects%252Fdaily-cards-hafifa-project%252Fglobal%252Fnetworks%252Fmynetwork:servicenetworking.googleapis.com]%0Amodule.vpc.google_compute_network_peering_routes_config.psa_routes["servicenetworking.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/networks/mynetwork/networkPeerings/servicenetworking-googleapis-com]%0Amodule.firewall.google_compute_firewall.allow-tag-ssh[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-ssh]%0Amodule.firewall.google_compute_firewall.allow-tag-https[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-https]%0Amodule.firewall.google_compute_firewall.allow-tag-http[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-http]%0Amodule.db.google_sql_database_instance.primary: Refreshing state... [id=daily-dashboard]%0Amodule.db.google_sql_user.users["cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com"]: Refreshing state... [id=cloudsql-sa@daily-cards-hafifa-project.iam//daily-dashboard]%0Amodule.firewall.google_compute_firewall.custom-rules["allow-cloudrun-to-sql"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/allow-cloudrun-to-sql]%0Amodule.backend_cloud_run.google_cloud_run_v2_service.service[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/services/backend-daily-cards]%0Amodule.frontend_cloud_run.google_cloud_run_v2_service.service[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/services/frontend-daily-cards]%0Amodule.external-lb.google_compute_region_network_endpoint_group.serverless["neg-0"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/networkEndpointGroups/external-lb-neg-0]%0Amodule.external-lb.google_compute_region_network_endpoint_group.serverless["neg-1"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/networkEndpointGroups/external-lb-neg-1]%0Amodule.external-lb.google_compute_backend_service.default["backend"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/backendServices/external-lb-backend]%0Amodule.external-lb.google_compute_backend_service.default["frontend"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/backendServices/external-lb-frontend]%0Amodule.external-lb.google_compute_url_map.default: Refreshing state... [id=projects/daily-cards-hafifa-project/global/urlMaps/external-lb]%0Amodule.external-lb.google_compute_target_https_proxy.default[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/targetHttpsProxies/external-lb]%0Amodule.external-lb.google_compute_global_forwarding_rule.default[""]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/forwardingRules/external-lb]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.vm-managed-sa-example2.google_compute_instance.default[0] will be created%0A  + resource "google_compute_instance" "default" {%0A      + allow_stopping_for_update = true%0A      + can_ip_forward            = false%0A      + cpu_platform              = (known after apply)%0A      + creation_timestamp        = (known after apply)%0A      + current_status            = (known after apply)%0A      + deletion_protection       = false%0A      + description               = "Managed by the compute-vm Terraform module."%0A      + effective_labels          = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "role"                       = "github-runner"%0A        }%0A      + enable_display            = false%0A      + id                        = (known after apply)%0A      + instance_id               = (known after apply)%0A      + label_fingerprint         = (known after apply)%0A      + labels                    = {%0A          + "role" = "github-runner"%0A        }%0A      + machine_type              = "e2-medium"%0A      + metadata                  = {%0A          + "startup-script" = <<-EOT%0A                metadata = {%0A                    startup-script = <<-EOF%0A                      #!/bin/bash%0A                      apt-get update && apt-get install -y curl jq git%0A                      mkdir /actions-runner && cd /actions-runner%0A                      RUNNER_VERSION="2.316.0"%0A                      curl -O -L https://github.com/actions/runner/releases/download/v${RUNNER_VERSION}/actions-runner-linux-x64-${RUNNER_VERSION}.tar.gz%0A                      tar xzf actions-runner-linux-x64-${RUNNER_VERSION}.tar.gz%0A                      ./config.sh --url https://github.com/ORG/REPO --token $RUNNER_TOKEN --unattended%0A                      ./svc.sh install && ./svc.sh start%0A                    EOF%0A                  }%0A            EOT%0A        }%0A      + metadata_fingerprint      = (known after apply)%0A      + min_cpu_platform          = (known after apply)%0A      + name                      = "github-runner"%0A      + project                   = "daily-cards-hafifa-project"%0A      + self_link                 = (known after apply)%0A      + tags                      = [%0A          + "github-runner",%0A        ]%0A      + tags_fingerprint          = (known after apply)%0A      + terraform_labels          = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "role"                       = "github-runner"%0A        }%0A      + zone                      = "me-west1-b"%0A%0A      + boot_disk {%0A          + auto_delete                = true%0A          + device_name                = (known after apply)%0A          + disk_encryption_key_sha256 = (known after apply)%0A          + guest_os_features          = (known after apply)%0A          + kms_key_self_link          = (known after apply)%0A          + mode                       = "READ_WRITE"%0A          + source                     = (known after apply)%0A%0A          + initialize_params {%0A              + architecture           = (known after apply)%0A              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"%0A              + labels                 = (known after apply)%0A              + provisioned_iops       = (known after apply)%0A              + provisioned_throughput = (known after apply)%0A              + resource_policies      = (known after apply)%0A              + size                   = 20%0A              + snapshot               = (known after apply)%0A              + type                   = "pd-standard"%0A            }%0A        }%0A%0A      + confidential_instance_config (known after apply)%0A%0A      + guest_accelerator (known after apply)%0A%0A      + network_interface {%0A          + internal_ipv6_prefix_length = (known after apply)%0A          + ipv6_access_type            = (known after apply)%0A          + ipv6_address                = (known after apply)%0A          + name                        = (known after apply)%0A          + network                     = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/global/networks/mynetwork"%0A          + network_attachment          = (known after apply)%0A          + network_ip                  = (known after apply)%0A          + stack_type                  = (known after apply)%0A          + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/vm"%0A          + subnetwork_project          = (known after apply)%0A        }%0A%0A      + reservation_affinity (known after apply)%0A%0A      + scheduling {%0A          + automatic_restart   = true%0A          + on_host_maintenance = "MIGRATE"%0A          + preemptible         = false%0A          + provisioning_model  = "STANDARD"%0A        }%0A%0A      + service_account {%0A          + email  = "gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com"%0A          + scopes = [%0A              + "https://www.googleapis.com/auth/cloud-platform",%0A            ]%0A        }%0A    }%0A%0A  # module.vm-managed-sa-example2.google_compute_region_disk.disks["data1"] will be destroyed%0A  # (because key ["data1"] is not in for_each map)%0A  - resource "google_compute_region_disk" "disks" {%0A      - create_snapshot_before_destroy = false -> null%0A      - creation_timestamp             = "2025-05-18T06:01:09.840-07:00" -> null%0A      - disk_id                        = "344832688055936250" -> null%0A      - effective_labels               = {%0A          - "disk_name"                  = "data1"%0A          - "disk_type"                  = "pd-balanced"%0A          - "goog-terraform-provisioned" = "true"%0A          - "role"                       = "github-runner"%0A        } -> null%0A      - id                             = "projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1" -> null%0A      - label_fingerprint              = "qLcyRWX_g7o=" -> null%0A      - labels                         = {%0A          - "disk_name" = "data1"%0A          - "disk_type" = "pd-balanced"%0A          - "role"      = "github-runner"%0A        } -> null%0A      - licenses                       = [] -> null%0A      - name                           = "github-runner-data1" -> null%0A      - physical_block_size_bytes      = 4096 -> null%0A      - project                        = "daily-cards-hafifa-project" -> null%0A      - region                         = "me-west1" -> null%0A      - replica_zones                  = [%0A          - "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/zones/me-west1-b",%0A          - "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/zones/me-west1-c",%0A        ] -> null%0A      - self_link                      = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1" -> null%0A      - size                           = 10 -> null%0A      - terraform_labels               = {%0A          - "disk_name"                  = "data1"%0A          - "disk_type"                  = "pd-balanced"%0A          - "goog-terraform-provisioned" = "true"%0A          - "role"                       = "github-runner"%0A        } -> null%0A      - type                           = "pd-balanced" -> null%0A      - users                          = [] -> null%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0AWarning: Available Write-only Attribute Alternative%0A%0A  with module.db.google_sql_user.users,%0A  on modules/cloudsql-instance/main.tf line 317, in resource "google_sql_user" "users":%0A 317:   password = each.value.password%0A%0AThe attribute password has a write-only alternative password_wo available.%0AUse the write-only alternative of the attribute when possible.%0A%0A(and one more similar warning elsewhere)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::Acquiring state lock. This may take a few moments...%0Arandom_string.jwt_secret: Refreshing state... [id=c+%25VD<}3-@xyL(#D]%0Amodule.project_folder.google_folder.folder[0]: Refreshing state... [id=folders/616505300661]%0Amodule.project.google_project.project[0]: Refreshing state... [id=projects/daily-cards-hafifa-project]%0Amodule.project.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iamcredentials.googleapis.com]%0Amodule.project.google_project_service.project_services["domains.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/domains.googleapis.com]%0Amodule.project.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/run.googleapis.com]%0Amodule.project.google_project_service.project_services["iap.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iap.googleapis.com]%0Amodule.project.google_project_service.project_services["serviceusage.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/serviceusage.googleapis.com]%0Amodule.project.google_project_service.project_services["dns.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/dns.googleapis.com]%0Amodule.project.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/iam.googleapis.com]%0Amodule.project.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/secretmanager.googleapis.com]%0Amodule.project.google_project_service.project_services["certificatemanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/certificatemanager.googleapis.com]%0Amodule.project.google_project_service.project_services["vpcaccess.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/vpcaccess.googleapis.com]%0Amodule.project.google_project_service.project_services["servicenetworking.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/servicenetworking.googleapis.com]%0Amodule.project.google_project_service.project_services["sqladmin.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/sqladmin.googleapis.com]%0Amodule.project.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=daily-cards-hafifa-project/cloudresourcemanager.googleapis.com]%0Amodule.project.google_project_service_identity.default["run.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/run.googleapis.com]%0Amodule.project.google_project_service_identity.default["servicenetworking.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/servicenetworking.googleapis.com]%0Amodule.project.google_project_service_identity.default["dns.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/dns.googleapis.com]%0Amodule.project.google_project_service_identity.default["certificatemanager.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/certificatemanager.googleapis.com]%0Amodule.project.google_project_service_identity.default["vpcaccess.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/vpcaccess.googleapis.com]%0Amodule.project.google_project_service_identity.default["sqladmin.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/sqladmin.googleapis.com]%0Amodule.project.google_project_service_identity.default["iap.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/iap.googleapis.com]%0Amodule.project.google_project_service_identity.default["secretmanager.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/services/secretmanager.googleapis.com]%0Amodule.project.google_project_iam_member.service_agents["dns"]: Refreshing state... [id=daily-cards-hafifa-project/roles/dns.serviceAgent/serviceAccount:service-418901622719@gcp-sa-dns.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["certificatemanager"]: Refreshing state... [id=daily-cards-hafifa-project/roles/certificatemanager.serviceAgent/serviceAccount:service-418901622719@gcp-sa-certificatemanager.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["service-networking"]: Refreshing state... [id=daily-cards-hafifa-project/roles/servicenetworking.serviceAgent/serviceAccount:service-418901622719@service-networking.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["serverless-robot-prod"]: Refreshing state... [id=daily-cards-hafifa-project/roles/run.serviceAgent/serviceAccount:service-418901622719@serverless-robot-prod.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["cloud-sql"]: Refreshing state... [id=daily-cards-hafifa-project/roles/cloudsql.serviceAgent/serviceAccount:service-418901622719@gcp-sa-cloud-sql.iam.gserviceaccount.com]%0Amodule.project.google_project_iam_member.service_agents["vpcaccess"]: Refreshing state... [id=daily-cards-hafifa-project/roles/vpcaccess.serviceAgent/serviceAccount:service-418901622719@gcp-sa-vpcaccess.iam.gserviceaccount.com]%0Agoogle_iam_workload_identity_pool.tf: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/tfpool]%0Adata.google_secret_manager_secret_version.iap_client_secret: Reading...%0Amodule.front_registry.google_artifact_registry_repository.registry: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/repositories/front-repo]%0Adata.google_secret_manager_secret_version.iap_client_id: Reading...%0Adata.google_secret_manager_secret_version.jwt_secret: Reading...%0Amodule.addresses.google_compute_global_address.global["elb"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/addresses/elb]%0Agoogle_iam_workload_identity_pool.gh: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/cloudrun]%0Amodule.cloud_run_back_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/cloudrun-back-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Agoogle_compute_region_security_policy.israel_only_policy: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/securityPolicies/allow-only-israel]%0Amodule.back_registry.google_artifact_registry_repository.registry: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/repositories/back-repo]%0Amodule.secret_manager.google_secret_manager_secret.default["jwt-secret"]: Refreshing state... [id=projects/daily-cards-hafifa-project/secrets/jwt-secret]%0Amodule.cloudsql_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.external-lb.google_compute_managed_ssl_certificate.default["default"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/sslCertificates/external-lb-default]%0Amodule.github_sa.google_service_account.service_account[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.vm-managed-sa-example2.google_compute_region_disk.disks["data1"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1]%0Amodule.vpc.google_compute_network.network[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/networks/mynetwork]%0Amodule.terraform_remote_State.google_storage_bucket.bucket[0]: Refreshing state... [id=tfstate-daily-project]%0Agoogle_iam_workload_identity_pool_provider.gh: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/cloudrun/providers/ghpool]%0Agoogle_iam_workload_identity_pool_provider.tf: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/global/workloadIdentityPools/tfpool/providers/tfpool]%0Amodule.secret_manager.google_secret_manager_secret_version.default["jwt-secret:v1"]: Refreshing state... [id=projects/418901622719/secrets/jwt-secret/versions/1]%0Amodule.cloud_run_back_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/cloudsql.client"]: Refreshing state... [id=daily-cards-hafifa-project/roles/cloudsql.client/serviceAccount:cloudrun-back-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.cloudsql_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/storage.admin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/storage.admin/serviceAccount:cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/appengine.appAdmin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/appengine.appAdmin/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/owner"]: Refreshing state... [id=daily-cards-hafifa-project/roles/owner/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.github_sa.google_project_iam_member.project-roles["daily-cards-hafifa-project-roles/run.admin"]: Refreshing state... [id=daily-cards-hafifa-project/roles/run.admin/serviceAccount:gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com]%0Amodule.db.random_password.passwords["cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com"]: Refreshing state... [id=none]%0Amodule.github_sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator]%0Amodule.github_sa.google_service_account_iam_binding.authoritative["roles/iam.serviceAccountUser"]: Refreshing state... [id=projects/daily-cards-hafifa-project/serviceAccounts/gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com/roles/iam.serviceAccountUser]%0Amodule.vpc.google_compute_subnetwork.proxy_only["me-west1/subnet-exl"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/subnet-exl]%0Adata.google_secret_manager_secret_version.iap_client_id: Read complete after 1s [id=projects/418901622719/secrets/iap-client-id/versions/1]%0Amodule.vpc.google_compute_route.gateway["restricted-googleapis"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/routes/mynetwork-restricted-googleapis]%0Adata.google_secret_manager_secret_version.iap_client_secret: Read complete after 1s [id=projects/418901622719/secrets/iap-client-secret/versions/1]%0Amodule.vpc.google_compute_route.gateway["private-googleapis"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/routes/mynetwork-private-googleapis]%0Adata.google_secret_manager_secret_version.jwt_secret: Read complete after 1s [id=projects/418901622719/secrets/jwt-secret/versions/1]%0Amodule.vpc.google_compute_subnetwork.subnetwork["me-west1/backend-cloudrun"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/backend-cloudrun]%0Amodule.vpc.google_compute_subnetwork.subnetwork["me-west1/vm"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/vm]%0Amodule.vpc.google_compute_global_address.psa_ranges["servicenetworking-googleapis-com-cloud-sql"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/addresses/servicenetworking-googleapis-com-cloud-sql]%0Amodule.vpc.google_service_networking_connection.psa_connection["servicenetworking.googleapis.com"]: Refreshing state... [id=projects%252Fdaily-cards-hafifa-project%252Fglobal%252Fnetworks%252Fmynetwork:servicenetworking.googleapis.com]%0Amodule.vpc.google_compute_network_peering_routes_config.psa_routes["servicenetworking.googleapis.com"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/networks/mynetwork/networkPeerings/servicenetworking-googleapis-com]%0Amodule.firewall.google_compute_firewall.allow-tag-ssh[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-ssh]%0Amodule.firewall.google_compute_firewall.allow-tag-https[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-https]%0Amodule.firewall.google_compute_firewall.allow-tag-http[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/mynetwork-ingress-tag-http]%0Amodule.db.google_sql_database_instance.primary: Refreshing state... [id=daily-dashboard]%0Amodule.db.google_sql_user.users["cloudsql-sa@daily-cards-hafifa-project.iam.gserviceaccount.com"]: Refreshing state... [id=cloudsql-sa@daily-cards-hafifa-project.iam//daily-dashboard]%0Amodule.firewall.google_compute_firewall.custom-rules["allow-cloudrun-to-sql"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/firewalls/allow-cloudrun-to-sql]%0Amodule.backend_cloud_run.google_cloud_run_v2_service.service[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/services/backend-daily-cards]%0Amodule.frontend_cloud_run.google_cloud_run_v2_service.service[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/locations/me-west1/services/frontend-daily-cards]%0Amodule.external-lb.google_compute_region_network_endpoint_group.serverless["neg-0"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/networkEndpointGroups/external-lb-neg-0]%0Amodule.external-lb.google_compute_region_network_endpoint_group.serverless["neg-1"]: Refreshing state... [id=projects/daily-cards-hafifa-project/regions/me-west1/networkEndpointGroups/external-lb-neg-1]%0Amodule.external-lb.google_compute_backend_service.default["backend"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/backendServices/external-lb-backend]%0Amodule.external-lb.google_compute_backend_service.default["frontend"]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/backendServices/external-lb-frontend]%0Amodule.external-lb.google_compute_url_map.default: Refreshing state... [id=projects/daily-cards-hafifa-project/global/urlMaps/external-lb]%0Amodule.external-lb.google_compute_target_https_proxy.default[0]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/targetHttpsProxies/external-lb]%0Amodule.external-lb.google_compute_global_forwarding_rule.default[""]: Refreshing state... [id=projects/daily-cards-hafifa-project/global/forwardingRules/external-lb]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.vm-managed-sa-example2.google_compute_instance.default[0] will be created%0A  + resource "google_compute_instance" "default" {%0A      + allow_stopping_for_update = true%0A      + can_ip_forward            = false%0A      + cpu_platform              = (known after apply)%0A      + creation_timestamp        = (known after apply)%0A      + current_status            = (known after apply)%0A      + deletion_protection       = false%0A      + description               = "Managed by the compute-vm Terraform module."%0A      + effective_labels          = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "role"                       = "github-runner"%0A        }%0A      + enable_display            = false%0A      + id                        = (known after apply)%0A      + instance_id               = (known after apply)%0A      + label_fingerprint         = (known after apply)%0A      + labels                    = {%0A          + "role" = "github-runner"%0A        }%0A      + machine_type              = "e2-medium"%0A      + metadata                  = {%0A          + "startup-script" = <<-EOT%0A                metadata = {%0A                    startup-script = <<-EOF%0A                      #!/bin/bash%0A                      apt-get update && apt-get install -y curl jq git%0A                      mkdir /actions-runner && cd /actions-runner%0A                      RUNNER_VERSION="2.316.0"%0A                      curl -O -L https://github.com/actions/runner/releases/download/v${RUNNER_VERSION}/actions-runner-linux-x64-${RUNNER_VERSION}.tar.gz%0A                      tar xzf actions-runner-linux-x64-${RUNNER_VERSION}.tar.gz%0A                      ./config.sh --url https://github.com/ORG/REPO --token $RUNNER_TOKEN --unattended%0A                      ./svc.sh install && ./svc.sh start%0A                    EOF%0A                  }%0A            EOT%0A        }%0A      + metadata_fingerprint      = (known after apply)%0A      + min_cpu_platform          = (known after apply)%0A      + name                      = "github-runner"%0A      + project                   = "daily-cards-hafifa-project"%0A      + self_link                 = (known after apply)%0A      + tags                      = [%0A          + "github-runner",%0A        ]%0A      + tags_fingerprint          = (known after apply)%0A      + terraform_labels          = {%0A          + "goog-terraform-provisioned" = "true"%0A          + "role"                       = "github-runner"%0A        }%0A      + zone                      = "me-west1-b"%0A%0A      + boot_disk {%0A          + auto_delete                = true%0A          + device_name                = (known after apply)%0A          + disk_encryption_key_sha256 = (known after apply)%0A          + guest_os_features          = (known after apply)%0A          + kms_key_self_link          = (known after apply)%0A          + mode                       = "READ_WRITE"%0A          + source                     = (known after apply)%0A%0A          + initialize_params {%0A              + architecture           = (known after apply)%0A              + image                  = "ubuntu-os-cloud/ubuntu-2204-lts"%0A              + labels                 = (known after apply)%0A              + provisioned_iops       = (known after apply)%0A              + provisioned_throughput = (known after apply)%0A              + resource_policies      = (known after apply)%0A              + size                   = 20%0A              + snapshot               = (known after apply)%0A              + type                   = "pd-standard"%0A            }%0A        }%0A%0A      + confidential_instance_config (known after apply)%0A%0A      + guest_accelerator (known after apply)%0A%0A      + network_interface {%0A          + internal_ipv6_prefix_length = (known after apply)%0A          + ipv6_access_type            = (known after apply)%0A          + ipv6_address                = (known after apply)%0A          + name                        = (known after apply)%0A          + network                     = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/global/networks/mynetwork"%0A          + network_attachment          = (known after apply)%0A          + network_ip                  = (known after apply)%0A          + stack_type                  = (known after apply)%0A          + subnetwork                  = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/regions/me-west1/subnetworks/vm"%0A          + subnetwork_project          = (known after apply)%0A        }%0A%0A      + reservation_affinity (known after apply)%0A%0A      + scheduling {%0A          + automatic_restart   = true%0A          + on_host_maintenance = "MIGRATE"%0A          + preemptible         = false%0A          + provisioning_model  = "STANDARD"%0A        }%0A%0A      + service_account {%0A          + email  = "gh-runner@daily-cards-hafifa-project.iam.gserviceaccount.com"%0A          + scopes = [%0A              + "https://www.googleapis.com/auth/cloud-platform",%0A            ]%0A        }%0A    }%0A%0A  # module.vm-managed-sa-example2.google_compute_region_disk.disks["data1"] will be destroyed%0A  # (because key ["data1"] is not in for_each map)%0A  - resource "google_compute_region_disk" "disks" {%0A      - create_snapshot_before_destroy = false -> null%0A      - creation_timestamp             = "2025-05-18T06:01:09.840-07:00" -> null%0A      - disk_id                        = "344832688055936250" -> null%0A      - effective_labels               = {%0A          - "disk_name"                  = "data1"%0A          - "disk_type"                  = "pd-balanced"%0A          - "goog-terraform-provisioned" = "true"%0A          - "role"                       = "github-runner"%0A        } -> null%0A      - id                             = "projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1" -> null%0A      - label_fingerprint              = "qLcyRWX_g7o=" -> null%0A      - labels                         = {%0A          - "disk_name" = "data1"%0A          - "disk_type" = "pd-balanced"%0A          - "role"      = "github-runner"%0A        } -> null%0A      - licenses                       = [] -> null%0A      - name                           = "github-runner-data1" -> null%0A      - physical_block_size_bytes      = 4096 -> null%0A      - project                        = "daily-cards-hafifa-project" -> null%0A      - region                         = "me-west1" -> null%0A      - replica_zones                  = [%0A          - "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/zones/me-west1-b",%0A          - "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/zones/me-west1-c",%0A        ] -> null%0A      - self_link                      = "https://www.googleapis.com/compute/v1/projects/daily-cards-hafifa-project/regions/me-west1/disks/github-runner-data1" -> null%0A      - size                           = 10 -> null%0A      - terraform_labels               = {%0A          - "disk_name"                  = "data1"%0A          - "disk_type"                  = "pd-balanced"%0A          - "goog-terraform-provisioned" = "true"%0A          - "role"                       = "github-runner"%0A        } -> null%0A      - type                           = "pd-balanced" -> null%0A      - users                          = [] -> null%0A        # (7 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0AWarning: Available Write-only Attribute Alternative%0A%0A  with module.db.google_sql_user.users,%0A  on modules/cloudsql-instance/main.tf line 317, in resource "google_sql_user" "users":%0A 317:   password = each.value.password%0A%0AThe attribute password has a write-only alternative password_wo available.%0AUse the write-only alternative of the attribute when possible.%0A%0A(and one more similar warning elsewhere)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0AReleasing state lock. This may take a few moments...%0A

::set-output name=stderr::

::set-output name=exitcode::0
```

<!-- Sticky Pull Request Commentterraform-plan -->